steven87090799/InkTime/esp32/ink-display-7C-photo/ink-display-7C-photo.ino
#include <WiFi.h>
#include <stddef.h>
#include <WebServer.h>
#include <HTTPClient.h>
#include <ArduinoJson.h>
#include <Preferences.h>
#include <SPI.h>
#include <time.h>
#include <sys/time.h>
#include "esp_heap_caps.h"
#include "esp_sntp.h"
#include "esp_system.h"

#include "hardware_profile.h"
#include "photopainter_core.h"
#include "offline_schedule_core.h"
#include "device_config_store.h"
#include "pairing_recovery_core.h"
#include "queue_client_core.h"
#include "queue_runtime_types.h"
#include "ack_journal_transaction_core.h"
#include "ack_journal_storage_budget.h"

// Arduino's prototype generator runs before later .ino declarations.  Keep
// these metadata types visible to generated CRC helper prototypes.
struct AckJournalSnapshotMeta;
struct AckJournalActivePointer;

#include "device_http_transport.h"
#if INKTIME_PHOTOPAINTER_ENABLED
#include "photopainter_support.h"
#include "power_manager.h"
#else
#include <GxEPD2_7C.h>
#endif
#include <HardwareSerial.h>
#include "esp_wifi.h"
#include "esp_bt.h"
#include "mbedtls/sha256.h"
#include "mbedtls/version.h"

#include "driver/gpio.h"
#include "driver/rtc_io.h"
#include "soc/soc_caps.h"

// =======================
//  正式版預設不輸出逐步序列 Log；需要除錯時以 -DINKTIME_DEBUG_LOG=1 編譯。
// =======================
#ifndef INKTIME_DEBUG_LOG
#define INKTIME_DEBUG_LOG 0
#endif
#define DEBUG_LOG INKTIME_DEBUG_LOG

HardwareSerial DebugSerial(0);

using inktime::kBoardConfig;

#if INKTIME_PHOTOPAINTER_ENABLED
inktime::PhotoPainterSupport photoPainter(kBoardConfig);
#endif

#if DEBUG_LOG
  #define DBG_BEGIN()    DebugSerial.begin(115200)
  #define DBG_PRINT(x)   DebugSerial.print(x)
  #define DBG_PRINTLN(x) DebugSerial.println(x)
#else
  #define DBG_BEGIN()
  #define DBG_PRINT(x)
  #define DBG_PRINTLN(x)
#endif

static const uint32_t FACTORY_RESET_SAMPLE_DELAY_MS = 5;

// =======================
//  AP 配置页保底：进入 AP 后 5 分钟没保存配置 -> 睡到“下一个刷新点”
// =======================
static const uint32_t AP_TIMEOUT_MS = 5UL * 60UL * 1000UL; // 5 分钟
static const uint8_t AP_MAX_SAVE_ATTEMPTS = 5;

// 實體面板固定 800x480；既有伺服器 payload 契約維持直向 480x800。
static constexpr int EPD_WIDTH  = kBoardConfig.display.width;
static constexpr int EPD_HEIGHT = kBoardConfig.display.height;
static constexpr int FB_WIDTH   = kBoardConfig.payloadWidth;
static constexpr int FB_HEIGHT  = kBoardConfig.payloadHeight;

#if !INKTIME_PHOTOPAINTER_ENABLED
GxEPD2_7C<
  INKTIME_PANEL_CLASS,
  INKTIME_PANEL_CLASS::HEIGHT / 4
> display(
  INKTIME_PANEL_CLASS(
    kBoardConfig.display.spi.cs,
    kBoardConfig.display.dc,
    kBoardConfig.display.reset,
    kBoardConfig.display.busy
  )
);
#endif

// =======================
//  舊版 URL 金鑰 API 已停用；新版透過每台裝置獨立 Bearer Token 取得 Manifest。
// =======================
#define DEVICE_MANIFEST_PATH "/api/device/v1/releases/latest"
#define DEVICE_STATUS_PATH   "/api/device/v1/status"
#define DEVICE_QUEUE_MANIFEST_PATH "/api/device/v1/queue/manifest"
#define DEVICE_QUEUE_ACK_PATH "/api/device/v1/queue/ack"
#define DEVICE_QUEUE_ACK_BATCH_PATH "/api/device/v1/queue/acks"
#define DEVICE_OFFLINE_SCHEDULE_PATH "/api/device/v1/offline-schedule"
#define DEVICE_PAIRING_REQUEST_PATH "/api/device/v1/pairing/request"
#define DEVICE_PAIRING_CLAIM_PATH "/api/device/v1/pairing/claim"
#define DEVICE_PAIRING_CONFIRM_PATH "/api/device/v1/pairing/confirm"
#define DEVICE_PAIRING_REPAIR_PERMISSION_PATH "/api/device/v1/pairing/repair-permission"
#define INKTIME_FIRMWARE_VERSION "2.8.0"

static constexpr uint8_t kQueueAckBatchMaxEvents = 8U;
static constexpr size_t kQueueAckBatchMaxBodyBytes = 12U * 1024U;

// Secure builds require a compile-time or portal-provisioned trust anchor;
// isolated LAN HTTP remains available only in an explicit development build.
#ifndef INKTIME_ALLOW_INSECURE_DEVICE_HTTP
#define INKTIME_ALLOW_INSECURE_DEVICE_HTTP 0
#endif

// =======================
//  配置存储 / WiFi / WebServer
// =======================
Preferences prefs;
WebServer  server(80);
inktime::DeviceConfigStore configStore;

struct RuntimeTelemetry {
  uint32_t wifi_connect_ms = 0;
  bool wifi_fast_path_attempted = false;
  bool wifi_fast_path_success = false;
  uint32_t network_session_ms = 0;
  uint32_t http_request_count = 0;
  uint32_t ntp_sync_ms = 0;
  bool ntp_sync_attempted = false;
  bool ntp_sync_succeeded = false;
  uint32_t download_bytes = 0;
  uint32_t nvs_write_count = 0;
  uint32_t ack_event_count = 0;
  uint32_t ack_batch_request_count = 0;
  uint32_t i2c_retry_count = 0;
  uint32_t i2c_bus_reset_count = 0;
  uint32_t i2c_fail_closed_count = 0;
  uint32_t gc_deleted_files = 0;
  uint32_t gc_deleted_bytes = 0;
  uint32_t gc_skipped_protected = 0;
  uint32_t epd_transfer_ms = 0;
  uint32_t applied_offline_schedule_version = 0;
  int64_t next_wake_epoch = 0;
  int64_t next_network_sync_epoch = 0;
  bool tls_handshake_count_unavailable = true;
  String tls_handshake_count_unavailable_reason =
      "transport_api_does_not_expose_handshake_count";
};

RuntimeTelemetry runtimeTelemetry;
static uint32_t networkSessionStartedMs = 0;
static constexpr uint64_t kPairingMinimumEpoch = 1700000000ULL;

struct Config {
  String  wifi_ssid;
  String  wifi_pass;
  String  backend_hostport;
  String  ca_pem;
  String  device_token;
  String  device_secret;
  String  device_id;
  String  auth_state;
  uint32_t credential_version;
  String  pairing_id;
  String  pairing_nonce;
  uint64_t pairing_expires_at_epoch;
  uint64_t pairing_retry_at_epoch;
  uint8_t pairing_retry_attempt;
  int32_t tz_offset_minutes;
  uint8_t refresh_hour;
  uint8_t refresh_minute;
  bool    rotate180;
#if INKTIME_PHOTOPAINTER_ENABLED
  inktime::OfflineSlot schedule_slots[inktime::kMaxOfflineSlots];
  uint8_t schedule_count;
  uint16_t prefetch_lead_minutes;
  String  delivery_mode;
  String  button_wake_action;
#endif
  String  sync_strategy;
  String  sync_time;
  uint32_t config_version;
  bool    valid;
};

// One transport object is shared by safe requests during a network wake.  It
// is deliberately closed before any EPD refresh so the radio cannot remain
// active while the panel is drawing power.
static inktime::DeviceHttpTransport wakeHttpTransport;
static String wakeHttpOrigin;
static bool wakeHttpSessionOpen = false;
static bool networkClosedForDisplay = false;

static void closeWakeHttpSession();
static void stopNetworkBeforeDisplay();

static void recordNvsWrite() {
  if (runtimeTelemetry.nvs_write_count < UINT32_MAX) ++runtimeTelemetry.nvs_write_count;
}

static int countedHttpGet(HTTPClient& http) {
  if (runtimeTelemetry.http_request_count < UINT32_MAX) ++runtimeTelemetry.http_request_count;
  return http.GET();
}

static int countedHttpPost(HTTPClient& http, const String& body) {
  if (runtimeTelemetry.http_request_count < UINT32_MAX) ++runtimeTelemetry.http_request_count;
  return http.POST(body);
}

static constexpr const char* kPairingRetryNamespace = "pairing_retry";
static constexpr const char* kPairingRetryAttemptKey = "attempt";
static constexpr const char* kPairingRetryDeadlineKey = "deadline";

