steven87090799/InkTime/esp32/ink-display-7C-photo/ink-display-7C-photo.ino
class PairingRetryMetadataStore final {
 public:
  bool load(
      inktime::pairing::RetryState& state,
      bool& present,
      String& error) const {
    state = inktime::pairing::RetryState{};
    present = false;
    error = "";
    Preferences storage;
    if (!storage.begin(kPairingRetryNamespace, true)) {
      error = "PAIRING-NVS-008";
      return false;
    }
    const bool has_attempt = storage.isKey(kPairingRetryAttemptKey);
    const bool has_deadline = storage.isKey(kPairingRetryDeadlineKey);
    if (!has_attempt && !has_deadline) {
      storage.end();
      return true;
    }
    if (!has_attempt || !has_deadline) {
      storage.end();
      error = "PAIRING-NVS-008";
      return false;
    }
    state.attempt = storage.getUChar(kPairingRetryAttemptKey, 0U);
    uint64_t deadline = 0U;
    const size_t read_size = storage.getBytes(
      kPairingRetryDeadlineKey, &deadline, sizeof(deadline));
    storage.end();
    if (read_size != sizeof(deadline)
        || state.attempt > inktime::pairing::kMaximumRetryAttempt) {
      error = "PAIRING-NVS-008";
      return false;
    }
    state.retry_at_epoch = deadline;
    present = true;
    return true;
  }

  bool save(const inktime::pairing::RetryState& state, String& error) const {
    error = "";
    Preferences storage;
    if (!storage.begin(kPairingRetryNamespace, false)) {
      error = "PAIRING-NVS-008";
      return false;
    }
    const size_t attempt_size = storage.putUChar(kPairingRetryAttemptKey, state.attempt);
    const size_t deadline_size = storage.putBytes(
      kPairingRetryDeadlineKey, &state.retry_at_epoch, sizeof(state.retry_at_epoch));
    if (attempt_size == sizeof(state.attempt)) recordNvsWrite();
    if (deadline_size == sizeof(state.retry_at_epoch)) recordNvsWrite();
    const uint8_t read_attempt = storage.getUChar(kPairingRetryAttemptKey, 0U);
    uint64_t read_deadline = 0U;
    const size_t read_size = storage.getBytes(
      kPairingRetryDeadlineKey, &read_deadline, sizeof(read_deadline));
    storage.end();
    if (attempt_size != sizeof(state.attempt)
        || deadline_size != sizeof(state.retry_at_epoch)
        || read_size != sizeof(read_deadline)
        || read_attempt != state.attempt
        || read_deadline != state.retry_at_epoch) {
      error = "PAIRING-NVS-008";
      return false;
    }
    return true;
  }

  bool clear(String& error) const {
    error = "";
    Preferences storage;
    if (!storage.begin(kPairingRetryNamespace, false)) {
      error = "PAIRING-NVS-008";
      return false;
    }
    bool ok = true;
    if (storage.isKey(kPairingRetryAttemptKey)) {
      const bool removed = storage.remove(kPairingRetryAttemptKey);
      if (removed) recordNvsWrite();
      else ok = false;
    }
    if (storage.isKey(kPairingRetryDeadlineKey)) {
      const bool removed = storage.remove(kPairingRetryDeadlineKey);
      if (removed) recordNvsWrite();
      else ok = false;
    }
    const bool empty = !storage.isKey(kPairingRetryAttemptKey)
      && !storage.isKey(kPairingRetryDeadlineKey);
    storage.end();
    if (!ok || !empty) {
      error = "PAIRING-NVS-008";
      return false;
    }
    return true;
  }
};

const char*  DEFAULT_HOSTPORT = "";
const int32_t DEFAULT_TZ_MINUTES = 8 * 60;
const uint8_t DEFAULT_HOUR    = 8;
const uint8_t DEFAULT_MINUTE  = 0;

static void applyFixedTimezoneWithoutNtp(int32_t offsetMinutes) {
  const int32_t absoluteMinutes = offsetMinutes < 0 ? -offsetMinutes : offsetMinutes;
  const char sign = offsetMinutes >= 0 ? '-' : '+';  // POSIX TZ signs are reversed.
  char timezone[24] = {0};
  snprintf(
    timezone,
    sizeof(timezone),
    "UTC%c%02ld:%02ld",
    sign,
    static_cast<long>(absoluteMinutes / 60),
    static_cast<long>(absoluteMinutes % 60)
  );
  setenv("TZ", timezone, 1);
  tzset();
}

#if INKTIME_PHOTOPAINTER_ENABLED
const uint16_t DEFAULT_PREFETCH_LEAD_MINUTES = 5;

static bool parseOfflineClock(const String &value, inktime::OfflineSlot &slot) {
  if (value.length() != 5 || value[2] != ':') return false;
  if (value[0] < '0' || value[0] > '9' || value[1] < '0' || value[1] > '9'
      || value[3] < '0' || value[3] > '9' || value[4] < '0' || value[4] > '9') return false;
  slot.hour = static_cast<uint8_t>((value[0] - '0') * 10 + value[1] - '0');
  slot.minute = static_cast<uint8_t>((value[3] - '0') * 10 + value[4] - '0');
  return inktime::validOfflineSlot(slot);
}

static bool nextIsoLocalDate(const String &value, String &output) {
  output = "";
  char next[11] = {0};
  if (!inktime::nextIsoLocalDateValue(value.c_str(), next, sizeof(next))) return false;
  output = String(next);
  return true;
}

static bool validDeliveryMode(const String &value) {
  return value == "legacy_online" || value == "stock_compat"
      || value == "inktime_offline_schedule";
}

static bool validButtonWakeAction(const String &value) {
  return value == "check_new" || value == "local_next";
}

static bool validSyncTime(const String &value) {
  if (value.isEmpty()) return true;
  if (value.length() != 5U || value[2] != ':') return false;
  if (value[0] < '0' || value[0] > '9' || value[1] < '0' || value[1] > '9'
      || value[3] < '0' || value[3] > '9' || value[4] < '0' || value[4] > '9') {
    return false;
  }
  const int hour = value.substring(0, 2).toInt();
  const int minute = value.substring(3, 5).toInt();
  return hour >= 0 && hour < 24 && minute >= 0 && minute < 60;
}

static bool validSyncStrategy(const String &strategy, const String &syncTime) {
  if (strategy != "first_display_lead" && strategy != "fixed_daily") return false;
  if (strategy == "first_display_lead") return syncTime.isEmpty();
  return !syncTime.isEmpty() && validSyncTime(syncTime);
}

static bool applyRemoteSchedule(JsonObject remoteConfig, int schemaVersion, Config &candidate) {
  if (schemaVersion < 3) {
    inktime::OfflineSlot legacy = {};
    String schedule = remoteConfig["schedule"] | "";
    if (!parseOfflineClock(schedule, legacy)) return false;
    candidate.schedule_count = 1;
    candidate.schedule_slots[0] = legacy;
    candidate.refresh_hour = legacy.hour;
    candidate.refresh_minute = legacy.minute;
    return true;
  }
  String delivery = remoteConfig["delivery_mode"] | candidate.delivery_mode;
  String button = remoteConfig["button_wake_action"] | candidate.button_wake_action;
  String syncStrategy = remoteConfig["sync_strategy"] | candidate.sync_strategy;
  String syncTime = remoteConfig["sync_time"] | candidate.sync_time;
  const JsonVariantConst leadValue = remoteConfig["prefetch_lead_minutes"];
  if (!leadValue.isNull() && (!leadValue.is<int>() || leadValue.is<bool>())) return false;
  int lead = leadValue.isNull() ? static_cast<int>(candidate.prefetch_lead_minutes) : (leadValue | -1);
  if (!validDeliveryMode(delivery) || !validButtonWakeAction(button)
      || !validSyncStrategy(syncStrategy, syncTime) || lead < 0 || lead > 120) return false;

  JsonArray rawTimes = remoteConfig["schedule_times"].as<JsonArray>();
  if (rawTimes.isNull() || rawTimes.size() == 0U || rawTimes.size() > inktime::kMaxOfflineSlots) return false;
  inktime::OfflineSlot slots[inktime::kMaxOfflineSlots] = {};
  for (size_t index = 0; index < rawTimes.size(); ++index) {
    if (!parseOfflineClock(rawTimes[index] | "", slots[index])) return false;
  }
  if (!inktime::validateOfflineSlots(slots, static_cast<uint8_t>(rawTimes.size()))) return false;
  candidate.delivery_mode = delivery;
  candidate.button_wake_action = button;
  candidate.sync_strategy = syncStrategy;
  candidate.sync_time = syncTime;
  candidate.prefetch_lead_minutes = static_cast<uint16_t>(lead);
  candidate.schedule_count = static_cast<uint8_t>(rawTimes.size());
  for (uint8_t index = 0; index < candidate.schedule_count; ++index) candidate.schedule_slots[index] = slots[index];
  candidate.refresh_hour = slots[0].hour;
  candidate.refresh_minute = slots[0].minute;
  return true;
}

#endif

Config g_cfg;
uint8_t* frameData = nullptr;
size_t frameDataSize = 0;
bool frameIndexed4 = false;
bool frameNativePalette = false;
bool serverConfigChanged = false;
bool currentPayloadShaVerified = false;
bool currentDisplaySkipped = false;
bool currentFromQueue = false;
bool currentPrefetchOnly = false;
bool enhancedNetworkWakeRequested = false;
bool currentPayloadIntegrityTrusted = false;
bool deviceAuthInvalid = false;
bool offlineDeliveryModeMismatchDetected = false;
#if !INKTIME_PHOTOPAINTER_ENABLED
static bool displayPairingCode(const Config &cfg, const String &pairingCode);
#endif
#if INKTIME_PHOTOPAINTER_ENABLED
bool offlineScheduleTxnBlocked = false;
#endif
String portalSetupSecret;
String portalNonce;
String portalApSsid;
String portalApPassword;
uint8_t portalSaveAttempts = 0;
bool portalSaveAllowed = false;
String currentReleaseId;
String currentRenderProfile;
String currentPayloadSha256;
String currentQueueItemId;
int64_t currentQueueVersion = -1;
String lastDeviceErrorCode;
String lastDeviceErrorMessage;
String lastDeviceWarningCode;
String lastDeviceWarningMessage;
bool queueAckPermanentReject = false;
uint32_t lastRefreshDurationMs = 0;

#if INKTIME_PHOTOPAINTER_ENABLED
static bool reconcilePendingScheduleConfigTransaction(Config &cfg);
#endif

