steven87090799/InkTime/esp32/ink-display-7C-photo/ink-display-7C-photo.ino
static String ackJournalBankKey(char bank, uint8_t index) {
  return String(bank) + String(index);
}

static String ackJournalSnapshotMetaKey(char bank) {
  return String("meta_") + String(bank);
}

struct __attribute__((packed)) AckJournalBlob {
  uint32_t magic;
  uint8_t version;
  uint8_t flags;
  int32_t queue_version;
  uint8_t event;
  uint8_t reserved;
  int64_t event_epoch;
  uint16_t item_length;
  uint16_t error_length;
  uint16_t release_length;
  char queue_item_id[inktime::kQueueIdentifierMaxBytes + 1U];
  char error_code[65U];
  char release_id[inktime::kQueueIdentifierMaxBytes + 1U];
  uint32_t crc32;
};

struct __attribute__((packed)) AckJournalSnapshotMeta {
  uint32_t magic;
  uint8_t version;
  uint8_t bank;
  uint8_t count;
  uint8_t reserved;
  uint64_t generation;
  uint32_t content_crc32;
  uint32_t crc32;
};

struct __attribute__((packed)) AckJournalActivePointer {
  uint32_t magic;
  uint8_t version;
  uint8_t bank;
  uint8_t count;
  uint8_t reserved;
  uint64_t generation;
  uint32_t crc32;
};

// The ACK namespace keeps two copy-on-write banks (G/H), one active pointer,
// and the legacy b0..b31/count representation during forward migration.
// Each bank is at most 32 compact blobs, so the worst-case peak is two banks
// plus one legacy generation.  The bounded blob size is intentionally kept
// below the ESP32 Preferences value limit; the repository-owned partition
// tables reserve 512 KiB of NVS and the shared budget header proves the peak
// including ConfigStore A/B, large-CA, retry/config metadata, migration, and
// safety margin.  The stock 20 KiB app3M_fat9M_16MB table is not valid for
// this firmware and must not be selected.

static constexpr uint32_t kAckJournalBlobMagic = 0x49544A31U;
static constexpr uint8_t kAckJournalBlobVersion = 1U;
static constexpr uint32_t kAckJournalSnapshotMagic = 0x49544A32U;
static constexpr uint8_t kAckJournalSnapshotVersion = 1U;
static constexpr uint32_t kAckJournalPointerMagic = 0x49544A33U;
static constexpr uint8_t kAckJournalPointerVersion = 1U;
static constexpr size_t kAckJournalPreferencesValueLimitBytes = 1984U;
static constexpr size_t kAckJournalPeakRecordBytes =
  inktime::ackjournal::kAckJournalPeakRecordBytes;
static constexpr size_t kAckJournalWorstCaseNvsBytes =
  inktime::ackjournal::kWorstCaseNvsBytes;
static_assert(
  sizeof(AckJournalBlob) == inktime::ackjournal::kAckJournalBlobBytes,
  "ACK journal budget must track the packed firmware blob");
static_assert(
  sizeof(AckJournalSnapshotMeta) == inktime::ackjournal::kAckJournalSnapshotMetaBytes,
  "ACK journal budget must track snapshot metadata");
static_assert(
  sizeof(AckJournalActivePointer) == inktime::ackjournal::kAckJournalActivePointerBytes,
  "ACK journal budget must track the active pointer");
static_assert(
  sizeof(AckJournalBlob) <= kAckJournalPreferencesValueLimitBytes,
  "ACK journal blob must remain within one Preferences/NVS value");
static_assert(
  kAckJournalWorstCaseNvsBytes <= inktime::ackjournal::kTargetNvsPartitionBytes,
  "ACK journal/config migration peak must fit the target NVS partition");

static uint32_t ackJournalCrcUpdate(
  uint32_t crc, const uint8_t *bytes, size_t length) {
  for (size_t index = 0; index < length; ++index) {
    crc ^= bytes[index];
    for (uint8_t bit = 0; bit < 8U; ++bit) {
      crc = (crc & 1U) != 0U ? (crc >> 1U) ^ 0xEDB88320U : crc >> 1U;
    }
  }
  return crc;
}

static uint32_t ackJournalCrcBytes(const uint8_t *bytes, size_t length) {
  return ackJournalCrcUpdate(0xFFFFFFFFU, bytes, length) ^ 0xFFFFFFFFU;
}

static uint32_t ackJournalCrc(const AckJournalBlob &blob) {
  return ackJournalCrcBytes(
    reinterpret_cast<const uint8_t *>(&blob), offsetof(AckJournalBlob, crc32));
}

static uint32_t ackJournalMetaCrc(const AckJournalSnapshotMeta &meta) {
  return ackJournalCrcBytes(
    reinterpret_cast<const uint8_t *>(&meta), offsetof(AckJournalSnapshotMeta, crc32));
}

static uint32_t ackJournalPointerCrc(const AckJournalActivePointer &pointer) {
  return ackJournalCrcBytes(
    reinterpret_cast<const uint8_t *>(&pointer), offsetof(AckJournalActivePointer, crc32));
}

static bool copyAckJournalText(char *destination, size_t capacity, const String &value) {
  if (destination == nullptr || value.length() >= capacity) return false;
  memcpy(destination, value.c_str(), value.length());
  destination[value.length()] = '\0';
  return true;
}

static bool encodeAckJournalBlob(
  const PendingQueueAck &pending,
  AckJournalBlob &blob
) {
  blob = {};
  blob.magic = kAckJournalBlobMagic;
  blob.version = kAckJournalBlobVersion;
  blob.flags = (pending.displaySkipped ? 0x01U : 0U)
    | (pending.delayedTerminal ? 0x02U : 0U);
  blob.queue_version = pending.queueVersion;
  blob.event = static_cast<uint8_t>(pending.event);
  blob.event_epoch = pending.eventEpoch;
  blob.item_length = static_cast<uint16_t>(pending.queueItemId.length());
  blob.error_length = static_cast<uint16_t>(pending.errorCode.length());
  blob.release_length = static_cast<uint16_t>(pending.releaseId.length());
  if (!pending.valid
      || !copyAckJournalText(blob.queue_item_id, sizeof(blob.queue_item_id), pending.queueItemId)
      || !copyAckJournalText(blob.error_code, sizeof(blob.error_code), pending.errorCode)
      || !copyAckJournalText(blob.release_id, sizeof(blob.release_id), pending.releaseId)) {
    lastDeviceErrorCode = "DEVICE-QUEUE-ACK-JOURNAL";
    lastDeviceErrorMessage = "ACK journal compact blob 欄位超出安全容量";
    return false;
  }
  blob.crc32 = ackJournalCrc(blob);
  return true;
}

static bool decodeAckJournalBlob(
  const AckJournalBlob &blob,
  PendingQueueAck &pending
) {
  if (blob.magic != kAckJournalBlobMagic
      || blob.version != kAckJournalBlobVersion
      || blob.crc32 != ackJournalCrc(blob)
      || blob.item_length >= sizeof(blob.queue_item_id)
      || blob.error_length >= sizeof(blob.error_code)
      || blob.release_length >= sizeof(blob.release_id)
      || blob.queue_item_id[blob.item_length] != '\0'
      || blob.error_code[blob.error_length] != '\0'
      || blob.release_id[blob.release_length] != '\0') {
    return false;
  }
  pending = {
    String(blob.queue_item_id),
    blob.queue_version,
    static_cast<inktime::QueueEvent>(blob.event),
    (blob.flags & 0x01U) != 0U,
    String(blob.error_code),
    (blob.flags & 0x02U) != 0U,
    String(blob.release_id),
    blob.event_epoch,
    false,
  };
  return validPendingQueueAck(pending);
}

static PendingQueueAck readAckJournalEntry(Preferences &journal, uint8_t index) {
  PendingQueueAck pending = {};
  const String blobKey = ackJournalBlobKey(index);
  const size_t blobLength = journal.getBytesLength(blobKey.c_str());
  if (blobLength > 0U) {
    AckJournalBlob blob = {};
    if (blobLength == sizeof(blob)
        && journal.getBytes(blobKey.c_str(), &blob, sizeof(blob)) == sizeof(blob)
        && decodeAckJournalBlob(blob, pending)) {
      return pending;
    }
    lastDeviceErrorCode = "DEVICE-QUEUE-ACK-JOURNAL";
    lastDeviceErrorMessage = "ACK journal compact blob CRC／readback 驗證失敗";
    return pending;
  }
  // Read the pre-blob per-field representation for one-time migration.
  pending = {
    journal.getString(ackJournalKey('i', index).c_str(), ""),
    journal.getInt(ackJournalKey('v', index).c_str(), -1),
    static_cast<inktime::QueueEvent>(
      journal.getUChar(ackJournalKey('e', index).c_str(), 255U)),
    journal.getBool(ackJournalKey('s', index).c_str(), false),
    journal.getString(ackJournalKey('r', index).c_str(), ""),
    journal.getBool(ackJournalKey('d', index).c_str(), false),
    journal.getString(ackJournalKey('l', index).c_str(), ""),
    journal.getLong64(ackJournalKey('t', index).c_str(), 0),
    false,
  };
  validPendingQueueAck(pending);
  return pending;
}

static bool samePendingQueueAck(
  const PendingQueueAck &left,
  const PendingQueueAck &right
) {
  return left.queueItemId == right.queueItemId
    && left.queueVersion == right.queueVersion
    && left.event == right.event;
}

static bool terminalAckEvidence(const PendingQueueAck &pending) {
  return pending.delayedTerminal
    && (pending.event == inktime::QueueEvent::DisplayCompleted
      || pending.event == inktime::QueueEvent::DisplayFailed);
}

static bool readAckJournalBytes(
  Preferences &journal,
  const String &key,
  std::string &bytes
) {
  const size_t length = journal.getBytesLength(key.c_str());
  if (length == 0U) return false;
  bytes.assign(length, '\0');
  return journal.getBytes(key.c_str(), &bytes[0], length) == length;
}

