steven87090799/InkTime/esp32/ink-display-7C-photo/ink-display-7C-photo.ino
static uint32_t ackJournalSnapshotContentCrc(
  char bank,
  uint64_t generation,
  const std::vector<std::string> &records
) {
  struct __attribute__((packed)) ContentHeader {
    uint8_t bank;
    uint8_t count;
    uint64_t generation;
  };
  const ContentHeader header = {
    static_cast<uint8_t>(bank),
    static_cast<uint8_t>(records.size()),
    generation,
  };
  uint32_t crc = 0xFFFFFFFFU;
  crc = ackJournalCrcUpdate(
    crc, reinterpret_cast<const uint8_t *>(&header), sizeof(header));
  for (const std::string &record : records) {
    crc = ackJournalCrcUpdate(
      crc, reinterpret_cast<const uint8_t *>(record.data()), record.size());
  }
  return crc ^ 0xFFFFFFFFU;
}

class AckJournalPreferencesStorage final : public inktime::ackjournal::Storage {
 public:
  explicit AckJournalPreferencesStorage(Preferences &journal) : journal_(journal) {}

  bool writeRecord(
    char bank,
    uint8_t index,
    const std::string &bytes
  ) override {
    if ((bank != 'G' && bank != 'H')
        || index >= inktime::kMaxAckJournalEntries
        || bytes.size() != sizeof(AckJournalBlob)) return false;
    const String key = ackJournalBankKey(bank, index);
    if (journal_.putBytes(key.c_str(), bytes.data(), bytes.size()) != bytes.size()) {
      lastDeviceErrorCode = "DEVICE-QUEUE-ACK-JOURNAL";
      lastDeviceErrorMessage = "ACK journal replacement blob 寫入失敗";
      return false;
    }
    std::string readback;
    const bool exact = readAckJournalBytes(journal_, key, readback) && readback == bytes;
    if (!exact) {
      lastDeviceErrorCode = "DEVICE-QUEUE-ACK-JOURNAL";
      lastDeviceErrorMessage = "ACK journal replacement blob exact readback 失敗";
      return false;
    }
    recordNvsWrite();
    return true;
  }

  bool writeSnapshotMetadata(
    char bank,
    uint64_t generation,
    const std::vector<std::string> &records
  ) override {
    if ((bank != 'G' && bank != 'H') || generation == 0U
        || records.size() > inktime::kMaxAckJournalEntries) return false;
    AckJournalSnapshotMeta meta = {};
    meta.magic = kAckJournalSnapshotMagic;
    meta.version = kAckJournalSnapshotVersion;
    meta.bank = static_cast<uint8_t>(bank);
    meta.count = static_cast<uint8_t>(records.size());
    meta.generation = generation;
    meta.content_crc32 = ackJournalSnapshotContentCrc(bank, generation, records);
    meta.crc32 = ackJournalMetaCrc(meta);
    const String key = ackJournalSnapshotMetaKey(bank);
    if (journal_.putBytes(key.c_str(), &meta, sizeof(meta)) != sizeof(meta)) {
      lastDeviceErrorCode = "DEVICE-QUEUE-ACK-JOURNAL";
      lastDeviceErrorMessage = "ACK journal snapshot metadata 寫入失敗";
      return false;
    }
    AckJournalSnapshotMeta readback = {};
    const bool exact = journal_.getBytesLength(key.c_str()) == sizeof(readback)
      && journal_.getBytes(key.c_str(), &readback, sizeof(readback)) == sizeof(readback)
      && memcmp(&readback, &meta, sizeof(meta)) == 0
      && readback.crc32 == ackJournalMetaCrc(readback);
    if (!exact) {
      lastDeviceErrorCode = "DEVICE-QUEUE-ACK-JOURNAL";
      lastDeviceErrorMessage = "ACK journal snapshot metadata exact readback 失敗";
      return false;
    }
    recordNvsWrite();
    return true;
  }

  bool writeActivePointer(char bank, uint64_t generation, uint8_t count) override {
    if ((bank != 'G' && bank != 'H') || generation == 0U
        || count > inktime::kMaxAckJournalEntries) return false;
    AckJournalActivePointer pointer = {};
    pointer.magic = kAckJournalPointerMagic;
    pointer.version = kAckJournalPointerVersion;
    pointer.bank = static_cast<uint8_t>(bank);
    pointer.count = count;
    pointer.generation = generation;
    pointer.crc32 = ackJournalPointerCrc(pointer);
    if (journal_.putBytes("active", &pointer, sizeof(pointer)) != sizeof(pointer)) {
      lastDeviceErrorCode = "DEVICE-QUEUE-ACK-JOURNAL";
      lastDeviceErrorMessage = "ACK journal active pointer 寫入失敗";
      return false;
    }
    AckJournalActivePointer readback = {};
    const bool exact = journal_.getBytesLength("active") == sizeof(readback)
      && journal_.getBytes("active", &readback, sizeof(readback)) == sizeof(readback)
      && memcmp(&readback, &pointer, sizeof(pointer)) == 0
      && readback.crc32 == ackJournalPointerCrc(readback);
    if (!exact) {
      lastDeviceErrorCode = "DEVICE-QUEUE-ACK-JOURNAL";
      lastDeviceErrorMessage = "ACK journal active pointer exact readback 失敗";
      return false;
    }
    recordNvsWrite();
    return true;
  }

  bool readSnapshot(
    char bank,
    inktime::ackjournal::Snapshot &snapshot,
    bool &present
  ) {
    present = false;
    const String metaKey = ackJournalSnapshotMetaKey(bank);
    if (journal_.getBytesLength(metaKey.c_str()) == 0U) return true;
    present = true;
    std::string metadata;
    if (!readAckJournalBytes(journal_, metaKey, metadata)
        || metadata.size() != sizeof(AckJournalSnapshotMeta)) return false;
    AckJournalSnapshotMeta meta = {};
    memcpy(&meta, metadata.data(), sizeof(meta));
    if (meta.magic != kAckJournalSnapshotMagic
        || meta.version != kAckJournalSnapshotVersion
        || meta.bank != static_cast<uint8_t>(bank)
        || meta.count > inktime::kMaxAckJournalEntries
        || meta.generation == 0U
        || meta.crc32 != ackJournalMetaCrc(meta)) return false;
    snapshot = {};
    snapshot.bank = bank;
    snapshot.generation = meta.generation;
    for (uint8_t index = 0U; index < meta.count; ++index) {
      std::string record;
      const String key = ackJournalBankKey(bank, index);
      if (!readAckJournalBytes(journal_, key, record)
          || record.size() != sizeof(AckJournalBlob)) return false;
      AckJournalBlob blob = {};
      memcpy(&blob, record.data(), sizeof(blob));
      if (blob.magic != kAckJournalBlobMagic
          || blob.version != kAckJournalBlobVersion
          || blob.crc32 != ackJournalCrc(blob)) return false;
      snapshot.records.push_back(record);
    }
    return ackJournalSnapshotContentCrc(
      bank, meta.generation, snapshot.records) == meta.content_crc32;
  }

  bool readActiveSnapshot(inktime::ackjournal::Snapshot &snapshot) {
    AckJournalActivePointer pointer = {};
    const bool pointerValid = journal_.getBytesLength("active") == sizeof(pointer)
      && journal_.getBytes("active", &pointer, sizeof(pointer)) == sizeof(pointer)
      && (pointer.bank == static_cast<uint8_t>('G')
        || pointer.bank == static_cast<uint8_t>('H'))
      && pointer.count <= inktime::kMaxAckJournalEntries
      && pointer.generation > 0U
      && pointer.magic == kAckJournalPointerMagic
      && pointer.version == kAckJournalPointerVersion
      && pointer.crc32 == ackJournalPointerCrc(pointer);
    if (pointerValid) {
      bool present = false;
      inktime::ackjournal::Snapshot pointed;
      if (readSnapshot(static_cast<char>(pointer.bank), pointed, present)
          && present && pointed.generation == pointer.generation
          && pointed.records.size() == pointer.count) {
        snapshot = pointed;
        return true;
      }
    }
    bool presentG = false;
    bool presentH = false;
    inktime::ackjournal::Snapshot candidateG;
    inktime::ackjournal::Snapshot candidateH;
    const bool validG = readSnapshot('G', candidateG, presentG) && presentG;
    const bool validH = readSnapshot('H', candidateH, presentH) && presentH;
    if (validG && validH) {
      // An invalid pointer can mean that the newer bank was fully prepared
      // but its authoritative pointer promotion tore.  The older complete
      // generation is the only fail-safe choice; replay is acceptable, ACK
      // evidence loss is not.  A successfully promoted bank remains safe
      // after cleanup because the previous bank is then no longer complete.
      snapshot = candidateG.generation <= candidateH.generation ? candidateG : candidateH;
      lastDeviceWarningCode = "DEVICE-QUEUE-ACK-RECOVERY";
      lastDeviceWarningMessage =
        "ACK journal active pointer 無效；已選擇較舊完整 generation 保留 at-least-once evidence";
      return true;
    }
    if (validG) {
      snapshot = candidateG;
      return true;
    }
    if (validH) {
      snapshot = candidateH;
      return true;
    }
    return false;
  }

  bool verifyActiveSnapshot(const inktime::ackjournal::Snapshot &expected) override {
    AckJournalActivePointer pointer = {};
    if (journal_.getBytesLength("active") != sizeof(pointer)
        || journal_.getBytes("active", &pointer, sizeof(pointer)) != sizeof(pointer)
        || pointer.bank != static_cast<uint8_t>(expected.bank)
        || pointer.generation != expected.generation
        || pointer.count != expected.records.size()
        || pointer.crc32 != ackJournalPointerCrc(pointer)) return false;
    inktime::ackjournal::Snapshot actual;
    bool present = false;
    if (!readSnapshot(expected.bank, actual, present) || !present) return false;
    return actual.bank == expected.bank
      && actual.generation == expected.generation
      && actual.records == expected.records;
  }

