steven87090799/InkTime/esp32/ink-display-7C-photo/ink-display-7C-photo.ino
  bool cleanupBank(char bank) {
    bool ok = true;
    for (uint8_t index = 0U; index < inktime::kMaxAckJournalEntries; ++index) {
      const String key = ackJournalBankKey(bank, index);
      if (journal_.isKey(key.c_str())
          && !journal_.remove(key.c_str())) ok = false;
    }
    const String metaKey = ackJournalSnapshotMetaKey(bank);
    if (journal_.isKey(metaKey.c_str())
        && !journal_.remove(metaKey.c_str())) ok = false;
    return ok;
  }

  bool cleanupPrevious(char bank) override {
    if (bank != 'G' && bank != 'H') return true;
    const bool ok = cleanupBank(bank);
    if (!ok) {
      lastDeviceWarningCode = "DEVICE-QUEUE-ACK-CLEANUP";
      lastDeviceWarningMessage =
        "ACK journal 舊 generation cleanup 失敗；新 active snapshot 已保留";
    }
    return ok;
  }

 private:
  Preferences &journal_;
};

static bool legacyAckJournalPresent(Preferences &journal) {
  if (journal.getUChar("count", 0U) > 0U) return true;
  for (uint8_t index = 0U; index < inktime::kMaxAckJournalEntries; ++index) {
    if (journal.isKey(ackJournalBlobKey(index).c_str())
        || journal.getString(ackJournalKey('i', index).c_str(), "").length() > 0U) {
      return true;
    }
  }
  return false;
}

static bool removeLegacyAckJournalKeys(Preferences &journal) {
  bool ok = true;
  if (journal.isKey("count") && !journal.remove("count")) ok = false;
  const char legacyPrefixes[] = {'i', 'v', 'e', 's', 'r', 'd', 'l', 't'};
  for (uint8_t index = 0U; index < inktime::kMaxAckJournalEntries; ++index) {
    const String blobKey = ackJournalBlobKey(index);
    if (journal.isKey(blobKey.c_str()) && !journal.remove(blobKey.c_str())) ok = false;
    for (const char prefix : legacyPrefixes) {
      const String key = ackJournalKey(prefix, index);
      if (journal.isKey(key.c_str()) && !journal.remove(key.c_str())) ok = false;
    }
  }
  return ok && journal.getUChar("count", 0U) == 0U;
}

static bool loadAckJournalState(
  Preferences &journal,
  PendingQueueAck *entries,
  uint8_t &count,
  char &activeBank,
  uint64_t &generation,
  bool &legacyPresent
) {
  count = 0U;
  activeBank = 0;
  generation = 0U;
  legacyPresent = legacyAckJournalPresent(journal);
  AckJournalPreferencesStorage storage(journal);
  inktime::ackjournal::Snapshot snapshot;
  if (storage.readActiveSnapshot(snapshot)) {
    if (snapshot.records.size() > inktime::kMaxAckJournalEntries) return false;
    for (const std::string &record : snapshot.records) {
      AckJournalBlob blob = {};
      PendingQueueAck pending = {};
      if (record.size() != sizeof(blob)) return false;
      memcpy(&blob, record.data(), sizeof(blob));
      if (!decodeAckJournalBlob(blob, pending) || !pending.valid) return false;
      if (entries != nullptr) entries[count++] = pending;
    }
    activeBank = snapshot.bank;
    generation = snapshot.generation;
    return true;
  }
  uint8_t legacyCount = min(
    journal.getUChar("count", 0U),
    static_cast<uint8_t>(inktime::kMaxAckJournalEntries));
  if (legacyCount == 0U && legacyPresent) {
    for (uint8_t index = 0U; index < inktime::kMaxAckJournalEntries; ++index) {
      if (journal.isKey(ackJournalBlobKey(index).c_str())
          || journal.isKey(ackJournalKey('i', index).c_str())) {
        legacyCount = index + 1U;
      }
    }
  }
  for (uint8_t index = 0U; index < legacyCount; ++index) {
    PendingQueueAck pending = readAckJournalEntry(journal, index);
    if (pending.valid && entries != nullptr) entries[count++] = pending;
  }
  return true;
}

static bool commitAckJournalEntries(
  Preferences &journal,
  const PendingQueueAck *entries,
  uint8_t count,
  char previousBank,
  uint64_t previousGeneration,
  bool legacyPresent
) {
  if (entries == nullptr || count > inktime::kMaxAckJournalEntries
      || previousGeneration == UINT64_MAX) {
    lastDeviceErrorCode = "DEVICE-QUEUE-ACK-JOURNAL";
    lastDeviceErrorMessage = "ACK journal snapshot state 無效";
    return false;
  }
  inktime::ackjournal::Snapshot next;
  next.bank = previousBank == 'G' ? 'H' : 'G';
  next.generation = previousGeneration == 0U ? 1U : previousGeneration + 1U;
  for (uint8_t index = 0U; index < count; ++index) {
    AckJournalBlob blob = {};
    if (!encodeAckJournalBlob(entries[index], blob)) return false;
    next.records.emplace_back(reinterpret_cast<const char *>(&blob), sizeof(blob));
  }
  AckJournalPreferencesStorage storage(journal);
  std::string error;
  if (!inktime::ackjournal::commitSnapshot(storage, previousBank, next, error)) {
    lastDeviceErrorCode = "DEVICE-QUEUE-ACK-JOURNAL";
    lastDeviceErrorMessage = error.c_str();
    return false;
  }
  if (legacyPresent
      && inktime::ackjournal::legacyCleanupAllowed(true)
      && !removeLegacyAckJournalKeys(journal)) {
    lastDeviceWarningCode = "DEVICE-QUEUE-ACK-CLEANUP";
    lastDeviceWarningMessage = "ACK journal legacy cleanup 失敗；canonical snapshot 已保留";
  }
  return true;
}

static uint8_t loadAckJournalEntries(
  PendingQueueAck *entries,
  uint8_t capacity
) {
  if (entries == nullptr || capacity == 0U) return 0U;
  Preferences journal;
  if (!journal.begin("acklog", true)) return 0U;
  PendingQueueAck loadedEntries[inktime::kMaxAckJournalEntries] = {};
  uint8_t count = 0U;
  char activeBank = 0;
  uint64_t generation = 0U;
  bool legacyPresent = false;
  const bool loaded = loadAckJournalState(
    journal, loadedEntries, count, activeBank, generation, legacyPresent);
  (void)activeBank;
  (void)generation;
  (void)legacyPresent;
  if (!loaded) {
    journal.end();
    return 0U;
  }
  const uint8_t copied = min(count, capacity);
  for (uint8_t index = 0U; index < copied; ++index) entries[index] = loadedEntries[index];
  journal.end();
  return copied;
}

static bool removeLegacyPendingQueueAck() {
  prefs.begin("dashcfg", false);
  if (prefs.remove("ack_item")) recordNvsWrite();
  if (prefs.remove("ack_ver")) recordNvsWrite();
  if (prefs.remove("ack_event")) recordNvsWrite();
  if (prefs.remove("ack_skip")) recordNvsWrite();
  if (prefs.remove("ack_error")) recordNvsWrite();
  prefs.end();
  prefs.begin("dashcfg", true);
  const char *legacyKeys[] = {
    "ack_item", "ack_ver", "ack_event", "ack_skip", "ack_error"};
  bool absent = true;
  for (const char *key : legacyKeys) {
    if (prefs.isKey(key)) absent = false;
  }
  prefs.end();
  return absent;
}

