steven87090799/InkTime/esp32/ink-display-7C-photo/ink-display-7C-photo.ino
  String base;
  if (!ensureWakeHttpSession(cfg, base) || WiFi.status() != WL_CONNECTED) {
    const bool retained = persistQueueAckBatch(pending, count);
    if (!retained) lastDeviceWarningMessage = "network unavailable 且 pending ACK 未能 durable 保留";
    return false;
  }

  for (uint8_t attempt = 0U; attempt <= inktime::kQueueRetryLimit; ++attempt) {
    HTTPClient ackHttp;
    String transportCode;
    String transportMessage;
    if (!wakeHttpTransport.begin(
          ackHttp, base + String(DEVICE_QUEUE_ACK_BATCH_PATH), 15000,
          transportCode, transportMessage)) {
      lastDeviceErrorCode = transportCode;
      lastDeviceErrorMessage = transportMessage;
      break;
    }
    if (!addDeviceAuthorization(ackHttp, cfg)) {
      ackHttp.end();
      const bool retained = persistQueueAckBatch(pending, count);
      if (!retained) lastDeviceWarningMessage = "authorization unavailable 且 pending ACK 未能 durable 保留";
      return false;
    }
    const char* responseHeaders[] = {"Content-Type"};
    ackHttp.collectHeaders(responseHeaders, 1);
    ackHttp.addHeader("Content-Type", "application/json");
    if (runtimeTelemetry.ack_batch_request_count < UINT32_MAX) {
      ++runtimeTelemetry.ack_batch_request_count;
    }
    const int status = countedHttpPost(ackHttp, body);
    const bool authFailed = handleDeviceAuthStatus(cfg, status);
    const int responseLength = ackHttp.getSize();
    const String responseContentType = ackHttp.header("Content-Type");
    if (authFailed) {
      ackHttp.end();
      const bool retained = persistQueueAckBatch(pending, count);
      if (!retained) lastDeviceWarningMessage = "authorization failure 且 pending ACK 未能 durable 保留";
      return false;
    }

    if (status == HTTP_CODE_OK && responseLength > 0 && responseLength <= 12 * 1024
        && responseContentType.startsWith("application/json")) {
      JsonDocument response;
      const DeserializationError responseError = deserializeJson(response, ackHttp.getStream());
      const String responseStatus = response["status"] | "";
      const JsonArrayConst results = response["results"].as<JsonArrayConst>();
      const bool responseValid = !responseError && !response.overflowed()
        && responseStatus == "ok" && !results.isNull() && results.size() == count;
      if (responseValid) {
        bool allResolved = true;
        bool stale = false;
        bool retainedTerminal = false;
        bool unresolvedOther = false;
        bool permanentRejected = false;
        bool durabilityFailure = false;
        for (uint8_t index = 0U; index < count; ++index) {
          const JsonObjectConst result = results[index].as<JsonObjectConst>();
          const String responseItem = result["queue_item_id"] | "";
          const String responseEvent = result["event"] | "";
          const int responseHttpStatus = result["http_status"] | 0;
          const String outcome = result["status"] | "";
          const String errorCode = result["error_code"] | "";
          const inktime::QueueAckResultDisposition disposition =
            inktime::queueAckResultDisposition(
              pending[index].queueItemId.c_str(),
              inktime::queueEventName(pending[index].event),
              responseItem.c_str(),
              responseEvent.c_str(),
              responseHttpStatus,
              outcome.c_str(),
              errorCode.c_str());
          if (disposition == inktime::QueueAckResultDisposition::Accepted) {
            const bool removed = removePendingQueueAck(pending[index]);
            if (inktime::ackjournal::retainDuplicateEvidence(true, removed)) {
              lastDeviceWarningCode = "DEVICE-QUEUE-ACK-CLEANUP";
              lastDeviceWarningMessage = "server 已接受 ACK，但 local cleanup 失敗；保留 duplicate-safe evidence";
            }
            continue;
          }
          if (disposition == inktime::QueueAckResultDisposition::Stale) {
            // Stale evidence is retained for recovery, but it can never
            // authorize this wake's display/config progression.
            allResolved = false;
            // A terminal event is crash-safe evidence, even when the queue
            // version has moved on before the next wake.  Keep it durable so
            // delayed-terminal recovery can still be accepted; dropping it
            // here would turn a transient stale response into lost history.
            if (terminalQueueAck(pending[index].event)) {
              if (!persistPendingQueueAck(pending[index])) {
                unresolvedOther = true;
                durabilityFailure = true;
              }
              allResolved = false;
              stale = true;
              retainedTerminal = true;
              continue;
            }
            const bool removed = removePendingQueueAck(pending[index]);
            if (inktime::ackjournal::retainDuplicateEvidence(true, removed)) {
              lastDeviceWarningCode = "DEVICE-QUEUE-ACK-CLEANUP";
              lastDeviceWarningMessage = "QUEUE-003 rejected ACK cleanup 失敗；保留 duplicate-safe evidence";
            }
            stale = true;
            continue;
          }
          if (disposition == inktime::QueueAckResultDisposition::AuthoritativePermanentReject) {
            // A per-event 4xx result is authoritative for this item.  Do not
            // keep retrying it or strand later config/schedule work in this
            // wake; quarantine the event and expose the rejection.
            const bool removed = removePendingQueueAck(pending[index]);
            if (inktime::ackjournal::retainDuplicateEvidence(true, removed)) {
              lastDeviceWarningCode = "DEVICE-QUEUE-ACK-CLEANUP";
              lastDeviceWarningMessage = "permanent ACK cleanup 失敗；保留 duplicate-safe evidence";
            }
            permanentRejected = true;
            continue;
          }
          if (!persistPendingQueueAck(pending[index])) {
            lastDeviceErrorCode = "DEVICE-QUEUE-ACK-DURABILITY";
            lastDeviceErrorMessage = "Queue ACK rejected event 無法 durable 保留";
            durabilityFailure = true;
          }
          allResolved = false;
          unresolvedOther = true;
        }
        ackHttp.end();
        queueAckPermanentReject = inktime::queueAckMayUnlockDisplay(
          permanentRejected, allResolved, unresolvedOther, durabilityFailure);
        if (stale) {
          lastDeviceErrorCode = "DEVICE-QUEUE-STALE";
          lastDeviceErrorMessage = "QUEUE-003 Queue version 已過期；下次重新取得 Manifest";
        }
        if (permanentRejected) {
          lastDeviceErrorCode = "DEVICE-QUEUE-ACK-PERMANENT";
          lastDeviceErrorMessage = "Queue ACK 已被伺服器永久拒絕；事件已 quarantine，本輪繼續後續工作";
        }
        if (allResolved) return true;
        if (allowRetainedTerminal && retainedTerminal && !unresolvedOther) return true;
        if (durabilityFailure) {
          lastDeviceErrorCode = "DEVICE-QUEUE-ACK-DURABILITY";
          lastDeviceErrorMessage = "Queue ACK batch rejected events 未能 durable 保留";
        } else {
          lastDeviceErrorCode = stale ? lastDeviceErrorCode : "DEVICE-QUEUE-ACK-REJECTED";
          lastDeviceErrorMessage = stale
            ? lastDeviceErrorMessage
            : "Queue ACK batch 含有拒絕事件；拒絕項目已 durable 保留";
        }
        return false;
      }
    }

