steven87090799/InkTime/esp32/ink-display-7C-photo/ink-display-7C-photo.ino
    ackHttp.end();
    const inktime::AckDecision decision = inktime::ackDecision(status, attempt);
    if (decision == inktime::AckDecision::StaleManifest) {
      const bool retained = persistQueueAckBatch(pending, count);
      lastDeviceErrorCode = "DEVICE-QUEUE-STALE";
      lastDeviceErrorMessage = retained
        ? "Queue ACK batch HTTP 409；pending events 已 durable 保留"
        : "Queue ACK batch HTTP 409；pending events 未能 durable 保留";
      return false;
    }
    if (decision == inktime::AckDecision::AuthorizationFailed) {
      const bool retained = persistQueueAckBatch(pending, count);
      lastDeviceErrorCode = "DEVICE-QUEUE-AUTH";
      lastDeviceErrorMessage = retained
        ? "Queue ACK Token／authorization 被拒絕；pending events 已 durable 保留"
        : "Queue ACK Token／authorization 被拒絕；pending events 未能 durable 保留";
      return false;
    }
    if (status == 429) {
      // Rate limiting is transient.  Keep the complete batch durable even
      // after the bounded retry budget is exhausted; it must never enter the
      // permanent-4xx quarantine path below.
      if (decision == inktime::AckDecision::Retry) {
        delay(250U * (attempt + 1U));
        continue;
      }
      break;
    }
    if (status >= 400 && status < 500 && status != HTTP_CODE_CONFLICT) {
      queueAckPermanentReject = true;
      for (uint8_t index = 0U; index < count; ++index) {
        const bool removed = removePendingQueueAck(pending[index]);
        if (inktime::ackjournal::retainDuplicateEvidence(true, removed)) {
          lastDeviceWarningCode = "DEVICE-QUEUE-ACK-CLEANUP";
          lastDeviceWarningMessage = "permanent HTTP ACK cleanup 失敗；保留 duplicate-safe evidence";
        }
      }
      lastDeviceErrorCode = "DEVICE-QUEUE-ACK-PERMANENT";
      lastDeviceErrorMessage = "Queue ACK HTTP 4xx 已永久拒絕；事件已 quarantine，本輪繼續後續工作";
      return true;
    }
    if (decision != inktime::AckDecision::Retry) break;
    delay(250U * (attempt + 1U));
  }
  const bool retained = persistQueueAckBatch(pending, count);
  lastDeviceErrorCode = "DEVICE-QUEUE-ACK-RETRY";
  lastDeviceErrorMessage = retained
    ? "Queue ACK batch 已達有界 retry 上限；pending events 已 durable 保留"
    : "Queue ACK batch 已達有界 retry 上限；pending events 未能 durable 保留";
  return false;
}

static bool flushRamQueueAckBatch(Config &cfg) {
  if (ramQueueAckBatchCount == 0U) return true;
  PendingQueueAck pending[kQueueAckBatchMaxEvents] = {};
  const uint8_t count = ramQueueAckBatchCount;
  for (uint8_t index = 0U; index < count; ++index) pending[index] = ramQueueAckBatch[index];
  ramQueueAckBatchCount = 0U;
  return postQueueAckBatch(cfg, pending, count);
}

static bool sendQueueEvent(
  Config &cfg,
  inktime::QueueEvent event,
  bool displaySkipped = false,
  const String &errorCode = String(""),
  bool delayedTerminal = false
) {
  const time_t eventNow = time(nullptr);
  PendingQueueAck pending = {
    currentQueueItemId,
    static_cast<int32_t>(currentQueueVersion),
    event,
    displaySkipped,
    errorCode.substring(0, 64),
    delayedTerminal,
    currentReleaseId,
    delayedTerminal && eventNow > 0 ? static_cast<int64_t>(eventNow) : 0,
    currentQueueItemId.length() > 0U && currentQueueVersion >= 0,
  };
  if (!pending.valid) return false;
  if (runtimeTelemetry.ack_event_count < UINT32_MAX) ++runtimeTelemetry.ack_event_count;
  if (terminalQueueAck(event) && !persistPendingQueueAck(pending)) return false;
  if (deviceAuthInvalid) return false;
  if (WiFi.status() != WL_CONNECTED) return false;
  if (ramQueueAckBatchCount >= kQueueAckBatchMaxEvents && !flushRamQueueAckBatch(cfg)) {
    if (!terminalQueueAck(event) && !persistPendingQueueAck(pending)) {
      lastDeviceWarningCode = "DEVICE-QUEUE-ACK-DURABILITY";
      lastDeviceWarningMessage = "RAM ACK batch flush failure 且 non-terminal ACK 未能 durable 保留";
    }
    return false;
  }
  ramQueueAckBatch[ramQueueAckBatchCount++] = pending;
  if (terminalQueueAck(event)) return flushRamQueueAckBatch(cfg);
  return ramQueueAckBatchCount < kQueueAckBatchMaxEvents
    || flushRamQueueAckBatch(cfg);
}

static bool resumePendingQueueAck(Config &cfg) {
  PendingQueueAck pending[inktime::kMaxAckJournalEntries] = {};
  const uint8_t count = loadAckJournalEntries(
    pending, inktime::kMaxAckJournalEntries);
  for (uint8_t offset = 0U; offset < count; offset += kQueueAckBatchMaxEvents) {
    const uint8_t remaining = count - offset;
    const uint8_t batchCount = min(remaining, kQueueAckBatchMaxEvents);
    if (!postQueueAckBatch(cfg, pending + offset, batchCount, true)) return false;
  }
  return true;
}

// =======================
//  下载每日相册 BIN
// =======================
bool downloadLatestPhotoBin(Config &cfg) {
  lastDeviceErrorCode = "";
  lastDeviceErrorMessage = "";
  currentFromQueue = false;
  currentQueueItemId = "";
  currentQueueVersion = -1;
  currentDisplaySkipped = false;
  currentPayloadShaVerified = false;
  currentPayloadIntegrityTrusted = false;
  currentPayloadSha256 = "";
  const size_t pixelCount = (size_t)FB_WIDTH * FB_HEIGHT;

#if INKTIME_PHOTOPAINTER_ENABLED
  if (!photoPainter.hardwareReady()) {
    lastDeviceErrorCode = photoPainter.lastError();
    lastDeviceErrorMessage = "PhotoPainter Flash／OPI PSRAM 尚未就緒";
    return false;
  }
#endif

  if (cfg.backend_hostport.length() == 0 || !hasDeviceCredential(cfg)) {
#if DEBUG_LOG
    DBG_PRINTLN("[HTTP] 伺服器或裝置 Token 尚未設定，跳過下載");
#endif
    lastDeviceErrorCode = "DEVICE-CONFIG";
    lastDeviceErrorMessage = "伺服器或裝置 credential 尚未設定";
    return false;
  }

  String base;
  if (!normalizedBackendBase(cfg, base)) return false;
  if (!ensureWakeHttpSession(cfg, base)) return false;
  String manifestUrl = base + String(DEVICE_MANIFEST_PATH);

#if DEBUG_LOG
  DBG_PRINTLN("[HTTP] 取得版本 Manifest（Authorization 已遮蔽）");
#endif

  inktime::DeviceHttpTransport &transport = wakeHttpTransport;
  HTTPClient manifestHttp;
  String transportCode;
  String transportMessage;
  const char* manifestHeaders[] = {"Content-Type"};
  manifestHttp.collectHeaders(manifestHeaders, 1);
  if (!transport.begin(manifestHttp, manifestUrl, 30000, transportCode, transportMessage)) {
    lastDeviceErrorCode = transportCode.length() ? transportCode : "DEVICE-MANIFEST-URL";
    lastDeviceErrorMessage = transportMessage.length() ? transportMessage : "Manifest URL 無法初始化";
    return false;
  }
  if (!addDeviceAuthorization(manifestHttp, cfg)) {
    manifestHttp.end();
    return false;
  }
  int manifestCode = countedHttpGet(manifestHttp);
  if (handleDeviceAuthStatus(cfg, manifestCode)) {
    manifestHttp.end();
    return false;
  }
  const int manifestLength = manifestHttp.getSize();
  const String manifestContentType = manifestHttp.header("Content-Type");
  if (manifestCode != HTTP_CODE_OK || manifestLength <= 0 || manifestLength > 65536
      || !manifestContentType.startsWith("application/json")) {
#if DEBUG_LOG
    DBG_PRINT("[HTTP] Manifest code="); DBG_PRINTLN(manifestCode);
#endif
    manifestHttp.end();
    lastDeviceErrorCode = "DEVICE-MANIFEST-HTTP";
    lastDeviceErrorMessage = "Manifest HTTP／Content-Type／長度不合法";
    return false;
  }

  JsonDocument manifest;
  DeserializationError jsonError = deserializeJson(manifest, manifestHttp.getStream());
  manifestHttp.end();
  int schemaVersion = manifest["schema_version"] | 0;
  String pixelFormat = manifest["pixel_format"] | "";
  if (jsonError || (schemaVersion != 1 && schemaVersion != 2 && schemaVersion != 3)
      || (pixelFormat != "2bpp" && pixelFormat != "indexed4")) {
#if DEBUG_LOG
    DBG_PRINTLN("[HTTP] Manifest 格式或版本不相容");
#endif
    lastDeviceErrorCode = "DEVICE-MANIFEST";
    lastDeviceErrorMessage = "Manifest 格式或版本不相容";
    return false;
  }

  // 伺服器端裝置頁是排程、時區與旋轉的正式來源；AP 值只在首次離線時備援。
  JsonObject remoteConfig = manifest["device_config"].as<JsonObject>();
  if (!remoteConfig.isNull()
      && (remoteConfig["schema_version"].as<int>() == 1
          || remoteConfig["schema_version"].as<int>() == 2
          || remoteConfig["schema_version"].as<int>() == 3)) {
    int offsetMinutes = remoteConfig["utc_offset_minutes"] | cfg.tz_offset_minutes;
    String schedule = remoteConfig["schedule"] | "";
    int separator = schedule.indexOf(':');
    int remoteHour = separator > 0 ? schedule.substring(0, separator).toInt() : -1;
    int remoteMinute = separator > 0 ? schedule.substring(separator + 1).toInt() : -1;
    int rotation = remoteConfig["rotation"] | (cfg.rotate180 ? 180 : 0);
    uint32_t desiredConfigVersion = remoteConfig["config_version"] | cfg.config_version;
    String desiredPanelProfile = remoteConfig["panel_profile"] | "safe_4c";
    bool compatiblePanel = desiredPanelProfile == "safe_4c"
      || desiredPanelProfile == String(INKTIME_PANEL_PROFILE);
    Config candidate = cfg;
#if INKTIME_PHOTOPAINTER_ENABLED
    if (cfg.delivery_mode == "inktime_offline_schedule"
        && (remoteConfig["schema_version"] | 0) < 3) {
      // A legacy/schema-2 latest manifest is the authoritative convergence
      // response after the server has moved this device out of enhanced
      // offline mode.  Do not leave the stale offline mode in NVS.
      candidate.delivery_mode = "legacy_online";
    }
    bool validSchedule = applyRemoteSchedule(
      remoteConfig,
      remoteConfig["schema_version"] | 0,
      candidate
    );
#else
    const bool validSchedule = true;
#endif
    bool validRemote = offsetMinutes >= -12 * 60 && offsetMinutes <= 14 * 60
      && remoteHour >= 0 && remoteHour <= 23 && remoteMinute >= 0 && remoteMinute <= 59
      && (rotation == 0 || rotation == 180) && compatiblePanel
      && desiredConfigVersion >= cfg.config_version && validSchedule;
    if (!validRemote) {
      lastDeviceErrorCode = "DEVICE-CONFIG-PROFILE";
      lastDeviceErrorMessage = "遠端設定版本或面板 Profile 與韌體不相容";
      return false;
    }
#if INKTIME_PHOTOPAINTER_ENABLED
    bool scheduleChanged = cfg.schedule_count != candidate.schedule_count;
    if (!scheduleChanged) {
      for (uint8_t index = 0; index < candidate.schedule_count; ++index) {
        if (cfg.schedule_slots[index].hour != candidate.schedule_slots[index].hour
            || cfg.schedule_slots[index].minute != candidate.schedule_slots[index].minute) {
          scheduleChanged = true;
          break;
        }
      }
    }
#endif
    if (
        cfg.tz_offset_minutes != offsetMinutes || cfg.refresh_hour != remoteHour
        || cfg.refresh_minute != remoteMinute || cfg.rotate180 != (rotation == 180)
        || cfg.config_version != desiredConfigVersion
#if INKTIME_PHOTOPAINTER_ENABLED
        || scheduleChanged
        || cfg.delivery_mode != candidate.delivery_mode
        || cfg.schedule_count != candidate.schedule_count
        || cfg.prefetch_lead_minutes != candidate.prefetch_lead_minutes
        || cfg.button_wake_action != candidate.button_wake_action) {
#else
        ) {
#endif
      candidate.tz_offset_minutes = offsetMinutes;
      candidate.refresh_hour = static_cast<uint8_t>(remoteHour);
      candidate.refresh_minute = static_cast<uint8_t>(remoteMinute);
      candidate.rotate180 = rotation == 180;
      candidate.config_version = desiredConfigVersion;
      String persistError;
      if (!saveConfig(candidate, &persistError)) {
        setConfigPersistenceError(persistError);
        return false;
      }
      cfg = candidate;
      serverConfigChanged = true;
#if DEBUG_LOG
      DBG_PRINTLN("[CFG] 已套用伺服器端裝置設定");
#endif
    }
  }

  int width = manifest["width"] | 0;
  int height = manifest["height"] | 0;
  JsonArray files = manifest["files"].as<JsonArray>();
  const char* downloadBaseRaw = manifest["download_base_url"] | "";
  String renderProfile = manifest["render_profile"] | "safe_4c";
  bool compatibleRenderProfile = renderProfile == "safe_4c"
    || renderProfile == String(INKTIME_PANEL_PROFILE);
  if (width != FB_WIDTH || height != FB_HEIGHT || files.size() == 0
      || strlen(downloadBaseRaw) == 0 || !compatibleRenderProfile) {
    lastDeviceErrorCode = "DEVICE-DISPLAY-MISMATCH";
    lastDeviceErrorMessage = "發布尺寸、Profile、檔案或下載路徑不相容";
    return false;
  }

  bool indexed4 = pixelFormat == "indexed4";
  size_t packedSize = pixelCount / (indexed4 ? 2 : 4);

  uint8_t* packed = nullptr;
#if INKTIME_PHOTOPAINTER_ENABLED
  packed = photoPainter.allocateWireBuffer(packedSize);
#else
  packed = (uint8_t*)heap_caps_malloc(packedSize, MALLOC_CAP_8BIT | MALLOC_CAP_SPIRAM);
  if (!packed) packed = (uint8_t*)heap_caps_malloc(packedSize, MALLOC_CAP_8BIT);
#endif
  if (!packed) {
    lastDeviceErrorCode = "DEVICE-MEMORY";
    lastDeviceErrorMessage = "無法配置下載緩衝區";
    return false;
  }

  // 隨機起點；若某張下載或校驗失敗，依序嘗試 Manifest 中其他照片。
  size_t startIndex = (size_t)random(0, files.size());
#if INKTIME_PHOTOPAINTER_ENABLED
  if (photoPainter.wokeFromUserButton()) {
    size_t previousIndex = 0;
    const bool hasPrevious = loadLastPhotoIndex(files.size(), previousIndex);
    startIndex = photoPainter.forceNetworkRefresh()
      ? (hasPrevious ? previousIndex : 0)
      : (hasPrevious ? (previousIndex + 1U) % files.size() : 0);
  }
#endif
  for (size_t attempt = 0; attempt < files.size(); ++attempt) {
    const size_t fileIndex = (startIndex + attempt) % files.size();
    JsonObject file = files[fileIndex];
    String fileName = file["name"] | "";
    size_t expectedSize = file["size"] | 0;
    String expectedSha = file["sha256"] | "";
    if (fileName.length() == 0 || expectedSize != packedSize
        || !inktime::isSha256Hex(expectedSha.c_str())) continue;

#if INKTIME_PHOTOPAINTER_ENABLED
    const uint32_t sourceHash = inktime::sourceHash32(expectedSha.c_str());
    const inktime::DisplayRotation rotation = cfg.rotate180
      ? inktime::DisplayRotation::Rotate180
      : inktime::DisplayRotation::Rotate0;
    uint8_t* cachedFrame = nullptr;
    if (photoPainter.loadCachedFrame(sourceHash, rotation, &cachedFrame, expectedSha.c_str())) {
      heap_caps_free(packed);
      if (frameData) heap_caps_free(frameData);
      frameData = cachedFrame;
      frameDataSize = inktime::kPhotoPainterFrameBytes;
      frameIndexed4 = true;
      frameNativePalette = true;
      currentReleaseId = manifest["release_id"] | "";
      currentRenderProfile = renderProfile;
      currentPayloadShaVerified = true;
      currentPayloadIntegrityTrusted = true;
      currentPayloadSha256 = expectedSha;
      saveLastPhotoIndex(fileIndex);
      return true;
    }
#endif

