steven87090799/InkTime/esp32/ink-display-7C-photo/ink-display-7C-photo.ino
void reportDeviceStatus(Config &cfg, bool displayUpdated) {
  if (WiFi.status() != WL_CONNECTED || cfg.backend_hostport.length() == 0 || !hasDeviceCredential(cfg)) return;
  String base;
  if (!normalizedBackendBase(cfg, base)) return;
  if (!ensureWakeHttpSession(cfg, base)) return;

  if (networkSessionStartedMs == 0U) networkSessionStartedMs = millis();
  runtimeTelemetry.network_session_ms = millis() - networkSessionStartedMs;
  const time_t telemetryNow = time(nullptr);
  nextRuntimeEpochs(
    cfg, telemetryNow, runtimeTelemetry.next_wake_epoch, runtimeTelemetry.next_network_sync_epoch);

#if INKTIME_PHOTOPAINTER_ENABLED
  photoPainter.readEnvironment();
  uint32_t validatedScheduleVersion = 0U;
  if (validatedActiveScheduleVersion(cfg, telemetryNow, validatedScheduleVersion)) {
    runtimeTelemetry.applied_offline_schedule_version = validatedScheduleVersion;
  }
  runtimeTelemetry.epd_transfer_ms = photoPainter.lastRefreshDurationMs();
  runtimeTelemetry.i2c_retry_count = photoPainter.i2cRetryCount();
  runtimeTelemetry.i2c_bus_reset_count = photoPainter.i2cBusResetCount();
  runtimeTelemetry.i2c_fail_closed_count = photoPainter.i2cFailClosedCount();
  runtimeTelemetry.gc_deleted_files = photoPainter.gcDeletedFiles();
  runtimeTelemetry.gc_deleted_bytes = photoPainter.gcDeletedBytes();
  runtimeTelemetry.gc_skipped_protected = photoPainter.gcSkippedProtected();
#endif
  JsonDocument payload;
  payload["firmware_version"] = INKTIME_FIRMWARE_VERSION;
  payload["board_profile"] = kBoardConfig.name;
  payload["wifi_rssi"] = WiFi.RSSI();
  payload["free_heap_bytes"] = ESP.getFreeHeap();
  payload["free_psram_bytes"] = ESP.getFreePsram();
  payload["wake_reason"] = String((int)esp_sleep_get_wakeup_cause());
  payload["wake_reason_detail"] = wakeReasonDetail();
  appendStatusReportedAt(payload, telemetryNow);
  payload["wifi_connect_ms"] = runtimeTelemetry.wifi_connect_ms;
  payload["wifi_fast_path_attempted"] = runtimeTelemetry.wifi_fast_path_attempted;
  payload["wifi_fast_path_success"] = runtimeTelemetry.wifi_fast_path_success;
  payload["network_session_ms"] = runtimeTelemetry.network_session_ms;
  payload["http_request_count"] = runtimeTelemetry.http_request_count;
  payload["ntp_sync_attempted"] = runtimeTelemetry.ntp_sync_attempted;
  payload["ntp_sync_succeeded"] = runtimeTelemetry.ntp_sync_succeeded;
  payload["ntp_sync_ms"] = runtimeTelemetry.ntp_sync_ms;
  payload["download_bytes"] = runtimeTelemetry.download_bytes;
  payload["nvs_write_count"] = runtimeTelemetry.nvs_write_count;
  payload["ack_event_count"] = runtimeTelemetry.ack_event_count;
  payload["ack_batch_request_count"] = runtimeTelemetry.ack_batch_request_count;
  payload["i2c_retry_count"] = runtimeTelemetry.i2c_retry_count;
  payload["i2c_bus_reset_count"] = runtimeTelemetry.i2c_bus_reset_count;
  payload["i2c_fail_closed_count"] = runtimeTelemetry.i2c_fail_closed_count;
  payload["gc_deleted_files"] = runtimeTelemetry.gc_deleted_files;
  payload["gc_deleted_bytes"] = runtimeTelemetry.gc_deleted_bytes;
  payload["gc_skipped_protected"] = runtimeTelemetry.gc_skipped_protected;
  payload["tls_handshake_count_unavailable"] = runtimeTelemetry.tls_handshake_count_unavailable;
  payload["tls_handshake_count_unavailable_reason"] =
      runtimeTelemetry.tls_handshake_count_unavailable_reason;
  if (runtimeTelemetry.next_wake_epoch > 0) {
    payload["next_wake_epoch"] = runtimeTelemetry.next_wake_epoch;
  } else {
    payload["next_wake_epoch"] = nullptr;
  }
  if (runtimeTelemetry.next_network_sync_epoch > 0) {
    payload["next_network_sync_epoch"] = runtimeTelemetry.next_network_sync_epoch;
  } else {
    payload["next_network_sync_epoch"] = nullptr;
  }
  if (runtimeTelemetry.applied_offline_schedule_version > 0U) {
    payload["applied_offline_schedule_version"] = runtimeTelemetry.applied_offline_schedule_version;
  } else {
    payload["applied_offline_schedule_version"] = nullptr;
  }
  payload["display_updated"] = displayUpdated;
  payload["display_skipped"] = currentDisplaySkipped;
  if (currentDisplaySkipped) payload["display_skip_reason"] = "same_sha256";
  payload["payload_sha256_verified"] = currentPayloadShaVerified;
  payload["applied_config_version"] = cfg.config_version;
  payload["panel_profile"] = INKTIME_PANEL_PROFILE;
  payload["render_profile"] = currentRenderProfile;
  payload["release_id"] = currentReleaseId;
  payload["error_code"] = lastDeviceErrorCode;
  payload["error_message"] = lastDeviceErrorMessage;
  payload["warning_code"] = lastDeviceWarningCode;
  payload["warning_message"] = lastDeviceWarningMessage;
#if INKTIME_ALLOW_INSECURE_DEVICE_HTTP
  payload["transport_profile"] = "trusted-lan-http";
  payload["transport_security_state"] = "degraded";
  payload["transport_warning"] = "no_tls";
#else
  payload["transport_profile"] = "https-only";
  payload["transport_security_state"] = "secure-required";
#endif
#if INKTIME_PHOTOPAINTER_ENABLED
  payload["flash_bytes"] = ESP.getFlashChipSize();
  payload["psram_bytes"] = ESP.getPsramSize();
  payload["flash_ready"] = photoPainter.flashReady();
  payload["psram_ready"] = photoPainter.psramReady();
  payload["sd_card"] = photoPainter.sdReady();
  payload["rtc"] = photoPainter.rtcReady();
  payload["cache_status"] = inktime::cacheStatusName(photoPainter.cacheStatus());
  payload["pmic_type"] = inktime::pmicTypeName(photoPainter.pmicType());
  payload["usb_power"] = photoPainter.usbConnected();
  if (photoPainter.batteryVoltage() > 0.0f) {
    payload["battery_voltage"] = photoPainter.batteryVoltage();
  }
  if (photoPainter.batteryPercent() >= 0) {
    payload["battery_percent"] = photoPainter.batteryPercent();
    payload["battery_percent_estimated"] = true;
  }
  if (photoPainter.environmentValid()) {
    payload["temperature_c"] = photoPainter.temperatureC();
    payload["humidity_percent"] = photoPainter.humidityPercent();
  }
  payload["button_wakeup"] = photoPainter.wokeFromUserButton();
  payload["sd_read_bytes"] = photoPainter.sdReadBytes();
  payload["sd_write_bytes"] = photoPainter.sdWriteBytes();
  payload["sd_write_ms"] = photoPainter.sdWriteDurationMs();
#endif
  payload["last_refresh_duration_ms"] = lastRefreshDurationMs;
  payload["epd_transfer_ms"] = runtimeTelemetry.epd_transfer_ms;
  const uint32_t awakeTotalMs = millis();
  payload["awake_total_ms"] = awakeTotalMs;
  payload["wake_duration_ms"] = awakeTotalMs;
  String body;
  serializeJson(payload, body);

  inktime::DeviceHttpTransport &statusTransport = wakeHttpTransport;
  HTTPClient statusHttp;
  String statusTransportCode;
  String statusTransportMessage;
  if (!statusTransport.begin(
        statusHttp, base + String(DEVICE_STATUS_PATH), 15000,
        statusTransportCode, statusTransportMessage)) {
    lastDeviceErrorCode = statusTransportCode;
    lastDeviceErrorMessage = statusTransportMessage;
    return;
  }
  if (!addDeviceAuthorization(statusHttp, cfg)) {
    statusHttp.end();
    return;
  }
  statusHttp.addHeader("Content-Type", "application/json");
  const int status = countedHttpPost(statusHttp, body);
  (void)handleDeviceAuthStatus(cfg, status);
  statusHttp.end();
}

// =======================
//  墨水屏显示
// =======================
void initDisplay(const Config &cfg) {
#if INKTIME_PHOTOPAINTER_ENABLED
  (void)cfg;
#else
#if DEBUG_LOG
  DBG_PRINTLN("[EPD] initDisplay");
#endif
  SPI.end();
  SPI.begin(
    kBoardConfig.display.spi.sck,
    kBoardConfig.display.spi.miso,
    kBoardConfig.display.spi.mosi,
    kBoardConfig.display.spi.cs
  );

  display.init(0, true, 2, false);

  if (cfg.rotate180) display.setRotation(3);
  else              display.setRotation(1);
#endif
}

